[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestForm.jsx:126:34
           isInvalid={Boolean(errors.dateNeeded)}
           {...register("dateNeeded", {
             required: "Date needed is required.",
-            validate: (value) => {
-              // simple compare as strings if both are in 'YYYY-MM-DDTHH:mm' form
-              // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
-              if (!dateRequested || !value) return true;
-              return value >= dateRequested || "Date needed must be after or equal to date requested.";
-            },
+            validate: (value) => {},
           })}
         />
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:130:22
               // simple compare as strings if both are in 'YYYY-MM-DDTHH:mm' form
               // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
               if (!dateRequested || !value) return true;
-              return value >= dateRequested || "Date needed must be after or equal to date requested.";
+              return value > dateRequested || "Date needed must be after or equal to date requested.";
             },
           })}
killedBy: RecommendationRequestForm tests dateNeeded equal to dateRequested allows submit (>=)
statusReason: expected "spy" to be called at least once

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:130:22
               // simple compare as strings if both are in 'YYYY-MM-DDTHH:mm' form
               // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
               if (!dateRequested || !value) return true;
-              return value >= dateRequested || "Date needed must be after or equal to date requested.";
+              return value >= dateRequested && "Date needed must be after or equal to date requested.";
             },
           })}
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""
