[Killed] BooleanLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:7:72
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RecommendationRequestsCreatePage({ storybook = false }) {
+export default function RecommendationRequestsCreatePage({ storybook = true }) {
   const objectToAxiosParams = (req) => ({
     url: "/api/recommendationrequests/post",
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ { to: '/recommendationrequests' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:8:41
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosParams = (req) => ({});
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
