[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:26:8
 
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.jsx:26:8
 
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:49:22
           isInvalid={Boolean(errors.requesterEmail)}
           {...register("requesterEmail", {
             required: "Requester email is required.",
-            pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-              message: "Enter a valid email address",
-            },
+            pattern: {},
             maxLength: { value: 254, message: "Max length 254 characters" },
           })}
killedBy: RecommendationRequestForm tests invalid requester email prevents submit
statusReason: Unable to find an element with the text: /Enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestForm.jsx:50:22
           {...register("requesterEmail", {
             required: "Requester email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /^[\s@]+@[^\s@]+\.[^\s@]+$/,
               message: "Enter a valid email address",
             },
killedBy: RecommendationRequestForm tests invalid professor email prevents submit
statusReason: Found multiple elements with the text: /Enter a valid email address/

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="invalid-feedback"
>

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestForm.jsx:50:22
           {...register("requesterEmail", {
             required: "Requester email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /^[^\s@]+@[^\S@]+\.[^\s@]+$/,
               message: "Enter a valid email address",
             },
killedBy: RecommendationRequestForm tests invalid professor email prevents submit
statusReason: Found multiple elements with the text: /Enter a valid email address/

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="invalid-feedback"
>

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:51:24
             required: "Requester email is required.",
             pattern: {
               value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-              message: "Enter a valid email address",
+              message: "",
             },
             maxLength: { value: 254, message: "Max length 254 characters" },
killedBy: RecommendationRequestForm tests invalid requester email prevents submit
statusReason: Unable to find an element with the text: /Enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:70:22
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "Professor email is required.",
-            pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-              message: "Enter a valid email address",
-            },
+            pattern: {},
             maxLength: { value: 254, message: "Max length 254 characters" },
           })}
killedBy: RecommendationRequestForm tests invalid professor email prevents submit
statusReason: Unable to find an element with the text: /Enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestForm.jsx:71:22
           {...register("professorEmail", {
             required: "Professor email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /^[^\s@]+@[^\s@]+\.[^\s@]$/,
               message: "Enter a valid email address",
             },
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestForm.jsx:71:22
           {...register("professorEmail", {
             required: "Professor email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /[^\s@]+@[^\s@]+\.[^\s@]+$/,
               message: "Enter a valid email address",
             },
killedBy: RecommendationRequestForm tests professor email rejects trailing characters and later-in-string emails (regex anchors)
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:90:39
           as="textarea"
           rows={3}
           isInvalid={Boolean(errors.explanation)}
-          {...register("explanation", {
-            required: "Explanation is required.",
-            maxLength: { value: 2000, message: "Max length 2000 characters" },
-          })}
+          {...register("explanation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests validations run
statusReason: Unable to find an element with the text: /Explanation is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:104:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="dateRequested">Date Requested</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-dateRequested"}
+          data-testid={testIdPrefix + ""}
           id="dateRequested"
           type="datetime-local"
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-dateRequested"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:108:41
           id="dateRequested"
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
-          {...register("dateRequested", {
-            required: "Date requested is required.",
-          })}
+          {...register("dateRequested", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests validations run
statusReason: Unable to find an element with the text: /Date requested is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequests/RecommendationRequestForm.jsx:113:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateRequested?.message}
+          {errors.dateRequested.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:124:24
           id="dateNeeded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
-          {...register("dateNeeded", {
+          {...register("", {
             required: "Date needed is required.",
             validate: (value) => {
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestForm.jsx:126:34
           isInvalid={Boolean(errors.dateNeeded)}
           {...register("dateNeeded", {
             required: "Date needed is required.",
-            validate: (value) => {
-              // simple compare as strings if both are in 'YYYY-MM-DDTHH:mm' form
-              // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
-              if (!dateRequested || !value) return true;
-              return (
-                value >= dateRequested ||
-                "Date needed must be after or equal to date requested."
-              );
-            },
+            validate: (value) => {},
           })}
         />
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:131:17
               // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
               if (!dateRequested || !value) return true;
               return (
-                value >= dateRequested ||
+                value < dateRequested ||
                 "Date needed must be after or equal to date requested."
               );
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.jsx:131:17
               // Stryker disable next-line ConditionalExpression, LogicalOperator, BooleanLiteral: guard clause must short-circuit when either is empty
               if (!dateRequested || !value) return true;
               return (
-                value >= dateRequested ||
-                "Date needed must be after or equal to date requested."
+                value >= dateRequested && "Date needed must be after or equal to date requested."
               );
             },
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.jsx:132:17
               if (!dateRequested || !value) return true;
               return (
                 value >= dateRequested ||
-                "Date needed must be after or equal to date requested."
+                ""
               );
             },
killedBy: RecommendationRequestForm tests dateNeeded must be after or equal to dateRequested
statusReason: Unable to find an element with the text: /Date needed must be after or equal to date requested\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequests/RecommendationRequestForm.jsx:138:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateNeeded?.message}
+          {errors.dateNeeded.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
