[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationrequests/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit navigates
statusReason: expected "spy" to be called with arguments: [ '/recommendationrequests/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/recommendationrequests/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: RecommendationRequestTable tests Edit navigates
statusReason: expected "spy" to be called with arguments: [ '/recommendationrequests/edit/2' ]

Received: 

  1st spy call:

  [
-   "/recommendationrequests/edit/2",

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:37:15
   };
 
   const columns = [
-    { header: "id", accessorKey: "id" },
+    { header: "", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
killedBy: RecommendationRequestTable tests renders empty table
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:38:5
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Requester Email", accessorKey: "requesterEmail" },
+    {},
     { header: "Professor Email", accessorKey: "professorEmail" },
     { header: "Explanation", accessorKey: "explanation" },
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:39:15
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Professor Email", accessorKey: "professorEmail" },
+    { header: "", accessorKey: "professorEmail" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
killedBy: RecommendationRequestTable tests renders empty table
statusReason: Unable to find an element with the text: Professor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:40:5
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
-    { header: "Explanation", accessorKey: "explanation" },
+    {},
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:40:15
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
-    { header: "Explanation", accessorKey: "explanation" },
+    { header: "", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
killedBy: RecommendationRequestTable tests renders empty table
statusReason: Unable to find an element with the text: Explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"
