[Killed] BooleanLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:8:69
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RecommendationRequestEditPage({ storybook = false }) {
+export default function RecommendationRequestEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (req) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: req.id,
-    },
-    data: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Recommendation Request Updated - id: 17 requester: student2@ucsb.edu",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:44:32
     },
   });
 
-  const onSuccess = (saved) => {
-    toast(
-      `Recommendation Request Updated - id: ${saved.id} requester: ${saved.requesterEmail}`,
-    );
-  };
+  const onSuccess = (saved) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {request && (
-          <RecommendationRequestForm
-            initialContents={request}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {request && (
-          <RecommendationRequestForm
-            initialContents={request}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
