[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:10:31
 export default function RecommendationRequestsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:11:10
   storybook = false,
 }) {
   const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Recommendation Request Created - id: 5 requester: student@ucsb.edu",

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:13:13
   const objectToAxiosParams = (req) => ({
     url: "/api/recommendationrequests/post",
     method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
+    params: {},
   });
 
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected {} to deeply equal { …(6) }

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.jsx:23:32
     },
   });
 
-  const onSuccess = (saved) => {
-    toast(
-      `New Recommendation Request Created - id: ${saved.id} requester: ${saved.requesterEmail}`,
-    );
-  };
+  const onSuccess = (saved) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
