[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:28:44
     },
   );
 
-  const objectToAxiosPutParams = (req) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: req.id,
-    },
-    data: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosPutParams = (req) => ({});
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Recommendation Request Updated - id: 17 requester: student2@ucsb.edu",

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (req) => ({
-    url: "/api/recommendationrequests",
+    url: "",
     method: "PUT",
     params: {
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Recommendation Request Updated - id: 17 requester: student2@ucsb.edu",

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:31:13
   const objectToAxiosPutParams = (req) => ({
     url: "/api/recommendationrequests",
     method: "PUT",
-    params: {
-      id: req.id,
-    },
+    params: {},
     data: {
       requesterEmail: req.requesterEmail,
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:46:7
 
   const onSuccess = (saved) => {
     toast(
-      `Recommendation Request Updated - id: ${saved.id} requester: ${saved.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Recommendation Request Updated - id: 17 requester: student2@ucsb.edu",

[Killed] LogicalOperator
main/pages/RecommendationRequests/RecommendationRequestsEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {request && (
-          <RecommendationRequestForm
-            initialContents={request}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {request || <RecommendationRequestForm initialContents={request} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
