[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:18:27
         <Button
           variant="primary"
           href="/recommendationrequests/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Recommendation Request
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.jsx:18:18
         <Button
           variant="primary"
           href="/recommendationrequests/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Recommendation Request
killedBy: RecommendationRequestsIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
