[Killed] BooleanLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:71
 
 import { RECOMMENDATION_REQUESTS_ALL_KEY } from "./keys";
 
-export default function RecommendationRequestCreatePage({ storybook = false }) {
+export default function RecommendationRequestCreatePage({ storybook = true }) {
   const objectToAxiosParams = (req) => ({
     url: "/api/recommendationrequests/post",
killedBy: RecommendationRequestCreatePage tests on submit, posts to backend and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ { to: '/recommendationrequest' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:10:31
 import { RECOMMENDATION_REQUESTS_ALL_KEY } from "./keys";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested,
-      dateNeeded: req.dateNeeded,
-      done: req.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (saved) => {
killedBy: RecommendationRequestCreatePage tests on submit, posts to backend and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:12:13
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (req) => ({
     url: "/api/recommendationrequests/post",
-    method: "POST",
+    method: "",
     params: {
       requesterEmail: req.requesterEmail,
killedBy: RecommendationRequestCreatePage tests on submit, posts to backend and redirects to /recommendationrequest
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:25:7
 
   const onSuccess = (saved) => {
     toast(
-      `New Recommendation Request Created - id: ${saved.id} requester: ${saved.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, posts to backend and redirects to /recommendationrequest
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Recommendation Request Created - id: 5 requester: student@ucsb.edu",
