[Killed] StringLiteral
main/pages/RecommendationRequest/keys.js:2:3
 export const RECOMMENDATION_REQUESTS_ALL_KEY = [
-  "/api/recommendationrequests/all",
+  "",
 ];
 
killedBy: RecommendationRequestCreatePage tests mutation cache key is correct
statusReason: expected [ '' ] to deeply equal [ '/api/recommendationrequests/all' ]
